app/views/users/show.html.erb


	<%@user.events.each do |event| %>
---
SELECT "events".* FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = $1  [["user_id", 94]]