app/views/events/show.html.erb

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 AND "attendances"."event_id" = $2 LIMIT $3  [["user_id", 0], ["event_id", 0], ["LIMIT", 1]]
---

	<% if Attendance.find_by(user_id: 'current_user.id', event_id: '@event.id')%>

SELECT  1 AS one FROM "users" INNER JOIN "attendances" ON "users"."id" = "attendances"."user_id" WHERE "attendances"."event_id" = $1 AND "users"."id" = $2 LIMIT $3  [["event_id", 61], ["id", 60], ["LIMIT", 1]]
---

				<% elsif @event.users.include?(current_user) %>