app/controllers/attendances_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]
---
		def index
		  	@event = Event.find(params[:id])