app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 94]]
---
  def show
    @event = Event.find(params[:id])
   @nb_visitors = Attendance.where(event_id: params[:id]).count

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create

  	@event = Event.create(start_date: params[:start_date], duration: params[:duration], title: params[:title], description: params[:description], price: params[:price], location: params[:location], admin_id: current_user.id )

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
INSERT INTO "attendances" ("stripe_customer_id", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "eeee"], ["user_id", 61], ["event_id", 80], ["created_at", "2019-05-10 08:10:38.424579"], ["updated_at", "2019-05-10 08:10:38.424579"]]
---
  def subscribe
      event = Event.find(params[:id])

        # Amount in cents
      @amount = event.price

      customer = Stripe::Customer.create({
        email: params[:stripeEmail],
        source: params[:stripeToken],
      })

      charge = Stripe::Charge.create({
        customer: customer.id,
        amount: @amount,
        description: 'Rails Stripe customer',
        currency: 'eur',
      })

       @attendance = Attendance.create(stripe_customer_id: "eeee", event: event, user: current_user)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]
UPDATE "events" SET "title" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["title", "TEST LIONEL modig"], ["updated_at", "2019-05-10 12:45:11.163272"], ["id", 94]]
---
def update
    @event = Event.find(params[:id])
    event_params = params.require(:event).permit(:start_date, :duration, :title,:description, :price , :location)
    if @event.update(event_params)