app/views/attendances/index.html.erb


          	<% @event.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "attendances" ON "users"."id" = "attendances"."user_id" WHERE "attendances"."event_id" = $1  [["event_id", 94]]

	                <h5 class="card-title">Participant : <%=user.first_name%> <%=user.last_name%> </h5>
	                  <p class="card-text">E-mail: <%=user.email%> <br> paid on <%=@event.attendances.select{|a| a.user==user}[0].created_at%> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 94]]